None
meme_dict = {
            "КРИНЖ": "Что-то очень странное или стыдное",
            "ЛОЛ": "Что-то очень смешное",
            "АГРО": "Человек который нецензурно себя видёт",
            "ТОКСИК": "Человек который нецензурно себя видёт",
            "СКИЛЛ": "это навык",
            "Хейтер": "о, этот неприятный тип будет писать злобные комментарии под вашими постами"
            {
word = input("Введите непонятное слово (большими буквами!): ")

if word in meme_dict.keys():
    # прочитать значение слова попытаться его понять
else:
    # найти другое непонятное слово
